{"url": "http://riverdale.wikia.com/wiki/Hermione_Lodge", "text": "Hermione Lodge Biographical Information Alias(es) Lady Macbeth, Natasha (by Veronica) Occupation Usherette (formerly) [1]\n\nCounter Attendant (formerly) [1]\n\nWaitress (formerly)\n\nBookkeeper\n\nBookkeeper Legal Officer of Lodge Industries\n\nMobster\n\nCo-owner of Andrews Construction\n\nMayor (formerly) Status Alive Relationships Affiliation The Bijou (formerly) [1]\n\nSpiffany's (formerly) [1]\n\nThe Midnight Club (formerly)\n\nPop's Chock'lit Shoppe (formerly)\n\nLodge Industries\n\nAndrews Construction Relatives Unnamed Mother\n\nUnnamed Mother-in-law\n\nUnnamed Father-in-law\n\nHiram Lodge (ex-husband)\n\nVeronica Lodge (daughter) Appearances Actor Marisol Nichols\n\nCamila Mendes (teen) First Appearance \"Chapter One: The River's Edge\" Last Appearance \"Chapter Seventy-Six: Killing Mr. Honey\" [Source]\n\n“ Veronica, in this business of ours, the women always walk the razor's edge. The men are the gangsters, but us, the molls, we use our wiles, our cunning, a hand on an elbow, a whisper in an ear, to manage things from behind the scenes. ” — Hermione to Veronica[src]\n\n\n\nHermione Apollonia Lodge (née Gomez) was initially a main character on The CW's Riverdale. She has since been demoted to recurring for the fifth season onward.[2] She is portrayed by Marisol Nichols.\n\nHermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She had a brief affair with Fred Andrews, but, their relationship ended when Hermione revealed that she was the buyer of the SoDale project.\n\nDuring her husband's incarceration, Hermione and their daughter were forced to leave New York and move back to her hometown Riverdale, during which time she attempted to turn Lodge Industries, their family business, into a legitimate company. However, upon Hiram's release, he regained control of the company. Since then, in an effort to assist Hiram in over seeing his master plan to monopolize Riverdale, Hermione has become Mayor of Riverdale. However, as things progressed, Hermione and Hiram no longer shared the same goals and she tried to have him killed twice. Unfortunately, she failed, and this resulted in their separation and subsequent marriage annulment. She was then taken into custody for attempted murder, during which time she was removed as mayor.\n\nCharacter Description\n\nHermione has now returned to Riverdale, eager to start afresh with her daughter following the scandalous incarceration of her husband.[3]\n\nEarly Life\n\nHermione grew up in Riverdale, her mother was a maid who worked at the Five Seasons and during that time, Hermione would go on to date Fred Andrews. Throughout her high school years, Hermione worked at local businesses such as the Bijou and Spiffany's.[1] During her youth, some would have described Hermione as a mean girl. She even believes her current misfortune was karma finally catching up to her. After she broke up with Fred, she married Hiram Lodge and the two moved to New York City. Together they had a daughter, Veronica. After Hiram was arrested for fraud and embezzlement, Hermione and Veronica left New York City and moved back to Riverdale. After the scandal, the only remaining property that was not seized because it was in Hermione's name was the luxurious apartment building, the Pembrooke, where she currently resides with her daughter.\n\nThroughout Riverdale\n\nPhysical Appearance\n\nHermione Lodge is a gorgeous middle-aged woman who possesses a sun-kissed complexion, calculating brown eyes, and luxuriant thick, wavy black hair. She is of average height, approximating 5'4\" with a narrow and attractive build. She wears elegant, stylish and expensive looking clothes, in a minimalist style which allows her to perfectly embody the look of a chic, well put together business woman.\n\nFormerly she wore the standard Pop's Chock'lit Shoppe employee uniform, before Fred Andrews hired her at Andrews Construction as his bookkeeper.\n\nPersonality\n\nHermione is a strong and confident, independent woman. She's also fairly intelligent, furthering along her plan to turn Lodge Industries into a legitimate business, leaving the Blossoms to wonder if they should have gotten her arrested instead of Hiram. While Hermione is a loving and caring mother, willing to do anything for Veronica, she's not so faithful as a wife. During Hiram's incarceration, she was having a secret love affair with Fred Andrews, up until he broke it off. Hermione also has hopes to regain that luxurious and expensive lifestyle that her family once lived, the lifestyle that she loved so much and had grown accustomed to.\n\nHermione is also very manipulative, while also being dishonest in order to accomplish the goal ahead of her. She lied about writing the blackmail letter threatening herself, claiming that it came from her when in fact it actually came from Hiram. She appears to be in league with him, sharing the same goals and ruthlessness when it comes to business. However, it becomes apparent that Hermione is only in league with herself, appointing FP as Sheriff and hiring him to kill Hiram only to later frame FP for the shooting.\n\nRelationships\n\nMain article: Hermione and Veronica\n\n“ You're playing with fire, I want you to know. ” — Hermione to Veronica about Hiram[src]\n\n\n\n\n\nThe relationship between Hermione and Veronica Lodge, so far, has been quite strong, they have shown to deeply care about each other, even though they have been known to fight on occasions. Their relationship may have developed over the course of the first season, however, since Hiram's return to Riverdale, Hermione has been antagonizing and taunting Veronica whenever she gets the chance. Before moving back to Riverdale, they both lived in New York City since Veronica's birth, along with Hiram Lodge, Hermione's husband and Veronica's father. After Hiram was arrested for fraud and embezzlement and subsequently incarcerated, Hermione and Veronica left New York City and moved back to her home town of Riverdale.\n\n\n\nMain article: Hermione and Hiram\n\n“ If you want to burn your relationship with our daughter, that's your business. But don't ever try to poison her against me. ” — Hiram to Hermione[src]\n\n\n\n\n\nHiram and Hermione were both raised in Riverdale, where they lived for most of there lives, and attended school together at Riverdale High School. They later married each other and moved to New York City, where they had there first and only child, daughter Veronica. However, shortly before the start of the series, Hiram was arrested and charged with multiple counts of embezzlement and fraud and subsequently incarcerated. While awaiting his trial, Hermione moved herself and her daughter back to her home town of Riverdale. After Hiram was released, he returned to his home town, Riverdale, where he took up residence at The Pembrooke, However, the relationship between the husband and wife has become quite complicated due to Hiram's past business deals, resulting in his imprisonment. However, when it comes down to business, they both work well with each other in accomplishing their goals.\n\nIn Chapter Sixty-Three: Hereditary, after getting out of prison after overcoming heated arguments, they are going to renew their vows again.\n\n\n\nMain article: Fred and Hermione\n\n“ I didn't call the police because I don't trust them, I don't trust half the people in this damn town. Just you. ” — Hermione to Fred[src]\n\n\n\n\n\nThe relationship between Fred and Hermione goes way back, both grew up in Riverdale and attended high school together, where they dated briefly before Hermione left him for the rich kid, Hiram Lodge. When she returned to Riverdale over a decade later, following the arrest of her husband, she and Fred rekindled their romance. However the relationship was ended by Fred the second time after learning that Hermione and Hiram were the anonymous buyers of the SoDale project. Though Hermione appears to still care for Fred, and his well-being. However, she is more interested in securing herself, as well as her relationship with Hiram, after he was recently released from prison and returned to Riverdale.\n\n\n\nPenelope and Hermione grew up in Riverdale together. They've been rivals since the two of them were students at Riverdale High School, and that rivalry continues on to this very day. The two rarely cross paths with each other, but when they do, it's hardly ever a pleasant exchange. They are also part of two of the wealthiest families in Riverdale. Their families have also had a past business deal with each other, up until Hiram Lodge's arrest.\n\n\n\nHermione and Alice's relationship dates back to their adolescents, with both of them growing up in Riverdale. The two were rivals while students at Riverdale High School. A rivalry that proved lasting once Hermione moved back into town with her daughter, Veronica Lodge, after many years of living in New York. Even though the two ladies may have there differences, with Alice being judgmental towards others, Hermione was more than willing to put their differences aside, when she invited Alice to accompany her at Pop's Chock'lit Shoppe, while she discussed Polly's Baby shower.\n\n\n\nHermione was possibly friends with Mary Andrews when they were friends in high school. The history between the two of them is remains unknown at the moment, but Mary's willingness to invite Hermione to accompany her and Fred at the Homecoming suggest some form of peaceful coexistence.\n\n\n\nAppearances\n\nGallery\n\nHermione Lodge's Gallery Can Be Found Here . The Gallery May Consist of Promotional Images, Screencaps, and Video Clips Released By Network Officials", "images": ["data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/adoptme/images/6/61/Wikia_from_DreamCraft.png/revision/latest/scale-to-width-down/640?cb=20200324164245", "https://static.wikia.nocookie.net/riverdalearchie/images/2/20/Season_1_Episode_5_Heart_of_Darkness_Hermione_and_Penelope.png/revision/latest/scale-to-width-down/250?cb=20170312182235", "https://static.wikia.nocookie.net/riverdalearchie/images/0/0d/Season_1_Episode_11_To_Riverdale_And_Back_Again_Homecoming_Fred_Hermione_and_Mary.PNG/revision/latest/scale-to-width-down/250?cb=20170428214854", "https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/0/0e/UC.JPG/revision/latest?cb=20200923195325", "https://static.wikia.nocookie.net/riverdalearchie/images/c/cb/RD-Caps-2x05-When-a-Stranger-Calls-98-Hiram-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171109190314", "https://static.wikia.nocookie.net/riverdalearchie/images/7/70/RD-Caps-2x03-The-Watcher-in-the-Woods-90-Veronica-Hermione.png/revision/latest/scale-to-width-down/250?cb=20171026212013", "https://static.wikia.nocookie.net/riverdalearchie/images/6/66/RD-S4-Hermione-Lodge.jpg/revision/latest/scale-to-width-down/350?cb=20200829183855", "https://static.wikia.nocookie.net/riverdalearchie/images/6/66/RD-S4-Hermione-Lodge.jpg/revision/latest?cb=20200829183855", "https://vignette.wikia.nocookie.net/riverdalearchie/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190508211625", "https://static.wikia.nocookie.net/riverdalearchie/images/e/e4/RD-Caps-2x05-When-a-Stranger-Calls-101-Hermione-Fred.png/revision/latest/scale-to-width-down/250?cb=20171109190917", "https://static.wikia.nocookie.net/riverdalearchie/images/b/b9/Season_1_Episode_8_The_Outsiders_Alice_Hermione_%281%29.jpg/revision/latest/scale-to-width-down/250?cb=20170403161633"], "top_img": "https://static.wikia.nocookie.net/riverdalearchie/images/6/66/RD-S4-Hermione-Lodge.jpg/revision/latest?cb=20200829183855", "keywords": [], "authors": [], "canonical_link": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "title": "Hermione Lodge", "meta_data": {"generator": "MediaWiki 1.33.3", "description": "Hermione Apollonia Lodge (née Gomez) was initially a main character on The CW's Riverdale. She has since been demoted to recurring for the fifth season onward.2 She is portrayed by Marisol Nichols. Hermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She had a brief affair...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "title": "Hermione Lodge | Archieverse Wiki | Fandom", "description": "Hermione Lodge | Archieverse Wiki | Fandom"}, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.25, maximum-scale=5.0", "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Archieverse Wiki", "title": "Hermione Lodge", "description": "Hermione Apollonia Lodge (née Gomez) was initially a main character on The CW's Riverdale. She has since been demoted to recurring for the fifth season onward.2 She is portrayed by Marisol Nichols. Hermione is the ex-wife of Hiram Lodge and the mother of Veronica Lodge. She had a brief affair with Fred Andrews, but, their relationship ended when Hermione revealed that she was the buyer of the SoDale project. During her husband's incarceration, Hermione and their daughter were forced to leave New", "url": "https://riverdale.fandom.com/wiki/Hermione_Lodge", "image": "https://static.wikia.nocookie.net/riverdalearchie/images/6/66/RD-S4-Hermione-Lodge.jpg/revision/latest?cb=20200829183855"}}, "movies": [], "publish_date": null, "source": "http://riverdale.wikia.com", "summary": ""}