{"url": "https://www.thebalancecareers.com/kate-gosselin-s-net-worth-and-income-sources-3515076", "text": "A selfie is a photo taken of yourself, by yourself. It's a self-portrait that usually winds up getting shared on social media sites like Instagram, Facebook, Twitter, and so forth. While just about everyone and their dog is guilty of snapping a selfie from time to time, celebrities have truly mastered the art of taking the most outrageous, funny, and bizarre selfies on the web. Check out a few of our favorites, below.\n\n01 of 25 Snoop Dogg Goes Full-On \"Silence of the Lambs\" Via Twitter/Snoopdogg. Are the lambs still screaming, Clarice? Snoop Dogg took a break from his perpetual 420 celebration by having some delicious pancakes. What he does with those pancakes is his own business!\n\n02 of 25 Madonna's Hairy Situation Via BCCL. Oh Madge. It seems the pop diva will do just about anything for attention these days, even... whatever this is. Could be worse! She could look like this horrible magazine cover in real life.\n\n03 of 25 Tyra Banks Goes Full-On Alien @tyrabanks Sure, she may be 99% forehead in this digitally-altered Instagram picture, but at least she's still SMIZING (smiling with her eyes).\n\n04 of 25 Lindsay Lohan's Warped Bathroom Via Instagram/LindsayLohan. This selfie that Lindsay Lohan took wouldn't be that bad, if it weren't for the fact that she clearly Photoshopped it to make herself look freakishly skinny. Oh Lindsay... when will you learn?!\n\n05 of 25 James Franco's Eye Pads Actor James Franco apparently has a beauty regimen, and he's not afraid to Instagram it!\n\n07 of 25 Six Degrees of Too Much Bacon? Via Instagram/imkevinbacon. Kevin Bacon posted this bizarre selfie to Instagram. Turns out it was just makeup for a movie role, but those pudgy cheeks definitely took the internet by surprise.\n\n08 of 25 Geraldo Rivera Gets Nekkid Via Twitter/GeraldoRivera. Oh, Geraldo, WHYYYYY? This photo was so poorly received that it actually cost Rivera some jobs. Turns out, his adoring fans did NOT want to see his 70 year-old dad bod. Weird, right?\n\n09 of 25 Lena Dunham's Undies What's going on here, Lena?. Courtesy: @lenadunham The Girls star frequently updates her unintentionally hilarious Instagram feed with gems like this one.\n\n10 of 25 Jessica Simpson Looks Great Via Twitter/JessicaSimpson. Not sure what's going on here? Join the club. I'm sure it made sense in Jessica Simpson's head.\n\n11 of 25 Nicolas Cage Is Soooooo Sleepy Speaking of annoying fan interactions.... When a Redditor was seated next to internet superstar Nicolas Cage on an airplane, she couldn't resist snapping this picture to share with the world. Poor Nic looks like he needs to catch up on some beauty sleep!\n\n12 of 25 Joseph Gordon Levitt and Daniel Radcliffe Ham It Up Before joining 2013 Oscars host Seth MacFarlane on stage for a big musical number, Joseph Gordon-Levitt and Daniel Radcliffe shared this awesome behind-the-scenes selfie.\n\n14 of 25 Elijah Wood's Selfie With Frodo While promoting The Lord of the Rings, actor Elijah Wood took a selfie with... himself. Sort of. That's his character, Frodo Baggins, on the movie poster behind him.\n\n15 of 25 Selena Gomez Goes Geeky Modelling oversized glasses and that old selfie staple, duck lips, singer Selena Gomez shared this dorky face with her millions of devoted followers on Instagram.\n\n16 of 25 Eminem Visits The Louvre, Still Isn't Happy On a trip to France, everyone's favorite angry rapper Eminem snapped this selfie of himself in front of one of the world's most famous paintings, The Mona Lisa. He's admiring one of the most amazing works of art in the world, yet he still looks ticked off? There's no pleasing some people.\n\n17 of 25 Amanda Bynes Gets Snappy Via Twitter/AmandaBynes. Back when actress Amanda Bynes was publically melting down, she was quite the prolific selfie-taker. Of all of them, this was the most inexplicable.\n\n18 of 25 Beyonce's Game Face Beyonce is beautiful, talented, and really protective of her public image, but that didn't stop her from snapping this awesome selfie with a fan.\n\n19 of 25 Chrissy Teigen is a Super Model. No, Really. Via Twitter/ChrissyTeigen. For a gorgeous super model, Chrissy Teigen sure can come up with some crazy-funny facial expressions! NEXT PAGE: Chris Pratt's yummy new abs and a few of Conan O'Brien's bromances....\n\n20 of 25 Brooklyn Decker Via Twitter/BrooklynDecker. Actress Brooklyn Decker doesn't mess around when it comes to perfecting her \"Derp\" face. NEXT PAGE: Chris Pratt's yummy new abs and Conan O'Brien's bromances....\n\n21 of 25 Chris Pratt: Who Knew? The actor who played the lovable (and pleasantly plump) \"Andy\" on Parks & Recreation got into phenomenal shape for a movie role, so he shared his rock-hard abs on Twitter. Thank you, Chris. Thank you.\n\n22 of 25 Pope-Tastic! He's hip; he's cool; he's the Pope! Pope Francis paused for a selfie with some young visitors who were touring the Vatican.\n\n23 of 25 Paul Rudd and Conan O'Brien Share a Bromance Via Twitter/ConanOBrien. We don't blame you a bit, Conan O'Brien. We kind of want to snuggle with Paul Rudd too.\n\n24 of 25 Conan O'Brien and Ricky Gervais Via Twitter/RickyGervais. Ricky Gervais, however... maybe not so much.\n\n25 of 25 Astronaut Selfie Okay, he's technically not a celebrity, but I had to include what could be the coolest selfie ever taken. International Space Station astronaut Aki Hoshide snapped this very scientific selfie while hovering in space back in 2012. According to NASA, “Visible in this outworldly assemblage is the Sun, the Earth, two portions of a robotic arm, an astronaut’s spacesuit, the deep darkness of space, and the unusual camera taking the picture.\"\n\n", "images": ["https://:0", "https://www.liveabout.com/thmb/YppV1FKLwe8oSUwItSZeWn_03dc=/220x0/filters:no_upscale():max_bytes(150000):strip_icc()/Humor2x-f7142b407e724a0b83823d713c2a2c0a.png", "https://www.liveabout.com/thmb/mO5DrUOTkRarFa4CaCWinEJ5F5I=/640x640/filters:fill(auto,1)/snoop-dogg-selfie-58b8bfa03df78c353c1920a2.jpg"], "top_img": "https://www.liveabout.com/thmb/mO5DrUOTkRarFa4CaCWinEJ5F5I=/640x640/filters:fill(auto,1)/snoop-dogg-selfie-58b8bfa03df78c353c1920a2.jpg", "keywords": [], "authors": ["Beverly Jenkins"], "canonical_link": "https://www.liveabout.com/our-favorite-celebrities-taking-funny-selfies-1923904", "title": "25 of Our Favorite Celebrities Taking Funny Selfies", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "As if we didn't already want Beyonce to be our BFF...! Take a look at some of our favorite Hollywood stars taking their silliest, funniest selfies.", "emailcontenttype": "LISTSC", "emailvertical": "LIVEABOUT", "sailthru.author": "Beverly Jenkins", "sailthru.tags": "humor,web-humor", "article": {"section": "LiveAbout"}, "fb": {"app_id": 233430483833280}, "og": {"type": "article", "site_name": "LiveAbout", "url": "https://www.liveabout.com/our-favorite-celebrities-taking-funny-selfies-1923904", "title": "25 of Our Favorite Celebrities Taking Funny Selfies", "description": "As if we didn't already want Beyonce to be our BFF...! Take a look at some of our favorite Hollywood stars taking their silliest, funniest selfies.", "image": "https://www.liveabout.com/thmb/mO5DrUOTkRarFa4CaCWinEJ5F5I=/640x640/filters:fill(auto,1)/snoop-dogg-selfie-58b8bfa03df78c353c1920a2.jpg"}, "twitter": {"card": "summary_large_image", "site": "@liveaboutcom", "title": "25 of Our Favorite Celebrities Taking Funny Selfies", "description": "As if we didn't already want Beyonce to be our BFF...! Take a look at some of our favorite Hollywood stars taking their silliest, funniest selfies.", "image": "https://www.liveabout.com/thmb/mO5DrUOTkRarFa4CaCWinEJ5F5I=/640x640/filters:fill(auto,1)/snoop-dogg-selfie-58b8bfa03df78c353c1920a2.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/3.53.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/3.53.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/3.53.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/3.53.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/3.53.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.thebalancecareers.com", "summary": ""}