{"url": "https://www.hollywoodreporter.com/lists/daytime-emmy-awards-2017-full-list-winners-998820", "text": "Getty Images Mary Hart with her lifetime achievement award.\n\nThe 44th annual Daytime Emmy Awards were handed out Sunday night.\n\nGeneral Hospital, The Ellen DeGeneres Show, The Talk, Entertainment Tonight, Good Morning America, Jeopardy! and Steve Harvey were among the night's big winners. Harvey, in fact, won two awards: best game show host for Family Feud and best informative talk show host for his eponymous talker.\n\nHeading into the ceremony, CBS' The Young and the Restless led all nominees with a total of 25, followed by the network's The Bold and the Beautiful. Both series were nominated for best daytime drama alongside NBC's Days of Our Lives and last year's winner, ABC's General Hospital. CBS also led all networks and streaming services with a total of 70 noms.\n\nAlso at the 44th Daytime Emmy Awards, former Entertainment Tonight host Mary Hart was honored with the lifetime achievement award. Longtime Jeopardy! and Wheel of Fortune producer Harry Friedman received the same honor Friday at the 44th Daytime Creative Arts Emmy Awards ceremony. Both awards shows took place at the Pasadena Civic Auditorium.\n\nThis year's nominees included The Hollywood Reporter, which landed its first-ever nom, for its Close Up With 'The Hollywood Reporter' series with Sundance TV, in the outstanding special-class series category. The executive producers are Matthew Belloni, Stephen Galloway, Paul Haddad, Jennifer Laski, Janice Min and Lacey Rose, with Stephanie Fischette serving as producer. THR previously won an Emmy for its roundtable discussion 'The Hollywood Reporter' in Focus: 'The Wolf of Wall Street', which aired on PBS SoCal.\n\nA list of Daytime Emmy winners in select categories follows. More on the Creative Arts Awards ceremony can be found here.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://www.hollywoodreporter.com/assets/1606142862/images/brand/favicon.ico?5de16d88930168405795", "https://static.hollywoodreporter.com/sites/default/files/2017/05/maryhart-928x523.jpg", "https://www.hollywoodreporter.com/assets/1606142862/images/brand/thr-logo-white.svg?5de16d88930168405795"], "top_img": "https://www.hollywoodreporter.com/assets/1606142862/images/brand/favicon.ico?5de16d88930168405795", "keywords": [], "authors": ["Kimberly Nordyke"], "canonical_link": "https://www.hollywoodreporter.com/lists/daytime-emmy-awards-2017-full-list-winners-998820", "title": "Daytime Emmy Awards: Winners List", "meta_data": {"viewport": "width=device-width", "sailthru.title": "Daytime Emmy Awards: Winners List", "sailthru.description": "'General Hospital,' 'Ellen,' 'The Talk,' 'Entertainment Tonight,' 'Good Morning America,' 'Jeopardy!' and Steve Harvey were among the night's big winners.", "sailthru.author": "Kimberly Nordyke", "sailthru.vertical": "Awards", "sailthru.date": "2017-04-30 16:53:45"}, "movies": [], "publish_date": 1493564025.0, "source": "https://www.hollywoodreporter.com", "summary": ""}