{"url": "https://www.metacritic.com/feature/tv-premiere-dates", "text": "TUE / December 1\n\n100% Wolf Animation/Family ($) Rent/Buy\n\nAlt Space Drama ($) Rent/Buy\n\nAngela's Christmas Wish Animation/Family\n\nBeast Mode Trailer Horror/Comedy ($) Rent/Buy\n\nCatfish: The TV Show Reality MTV, 9p\n\nDisco Foreign/Thriller ($) Rent/Buy\n\nThe Holiday Movies That Made Us Reality\n\nMighty Cruise Ships Reality Smithsonian, 8p\n\nThe Mystery of the Pink Flamingo Trailer Documentary ($) Rent/Buy\n\nNatalie Palamides: Nate - A One Man Show Comedy special\n\nOur Own Christmas Music OWN, 9p\n\nThirst Trailer Horror ($) Rent/Buy\n\nThe Witmans Reality ID, 9p\n\nWED / December 2\n\nAlien Worlds Trailer Documentary\n\nAri Eldjárn: Pardon My Icelandic Comedy special\n\nBaby God Trailer Documentary 9p\n\nChristmas in Rockefeller Center Special 8p\n\nChristmas Spectacular Starring the Radio City Rockettes Special 10p\n\nCourt Cam Trailer Reality A&E, 9p\n\nFierce Foreign/Musical\n\nHazel Brugger: Tropical Comedy special\n\nRescue Cam Trailer Reality A&E, 10p\n\nSEAL Team Drama 9p\n\nDelayed by one week (a ripple effect from preemptions caused by extended election coverage), the drama now launches tonight with a two-hour premiere.\n\nTrafficked with Mariana van Zeller Trailer Reality Nat Geo, 9p\n\nTHU / December 3\n\nAnything for Jackson Trailer Horror/Thriller Shudder\n\nBarrett-Jackson Revved Up Reality FYI, 9p\n\nBattleBots Robot fighting Discovery, 8p\n\nBreak Foreign/Comedy/Drama\n\nBugs Bunny's 24 Carrot Holiday Special Trailer Animation/Family HBO Max\n\nChico Bon Bon and the Very Berry Holiday Trailer Animation/Family\n\nThe Commons Drama Sundance Now\n\nConspiracies Decoded Reality Science, 10p\n\nFlipping Across America Reality HGTV, 8p\n\nHeaven's Gate: The Cult of Cults Trailer Documentary HBO Max\n\nThe four-episode docuseries recounts the tragic story of the UFO-obsessed cult from the 1970s to the 90s. It streams in its entirety today. (Note that non-subscribers can stream episode 1 for free beginning tomorrow.)\n\niHeartRadio Jingle Ball Greatest Moments Music 8p\n\nJust Another Christmas Foreign/Comedy\n\nKiller Cases Reality A&E, 10p\n\nMy Gift: A Christmas Special From Carrie Underwood Music HBO Max\n\nMysteries of the Abandoned Reality Science, 9p\n\nRocket Around the Christmas Tree Reality Discovery, 10p\n\nStylish With Jenna Lyons Trailer Reality HBO Max\n\nSwamp People: Serpent Invasion Reality History, 9p\n\nA Time to Kill Reality ID, 9p\n\nTripping with Nils Frahm Documentary/Music MUBI\n\nThe Voice Holiday Celebration Special 8p\n\nFRI / December 4\n\n▣ 76 Days Documentary ($) Virtual theaters\n\nWell-reviwed TIFF documentary focuses on Wuhan, China during the first few months of the covid-19 outbreak.\n\n▣ Ammonite Trailer Drama ($) Rent\n\nKate Winslet and Saoirse Ronan star in a romance set in 1840s England. Critics generally liked Francis Lee's drama when it debuted on the festival circuit this fall, though it suffered in comparison to last year's period lesbian romance Portrait of a Lady on Fire.\n\nBhaag Beanie Bhaag Foreign/Comedy\n\nBlue Bloods Drama 10p\n\nBombay Rose Foreign/Animation/Drama\n\nCaptain Underpants Mega Blissmas Animation/Family\n\nChristmas Crossfire Foreign/Comedy\n\nCrock of Gold—A Few Rounds With Shane MacGowan Trailer Documentary/Music ($) Rent/Buy\n\nJulien Temple's latest rock doc traces the life of Pogues frontman Shane MacGowan.\n\nDisney Holiday Magic Quest Reality Disney, 8p\n\nLooking for grainy, black-and-white footage of a Martian daytime? Apple's new nature series has none of those things; instead, it uses innovative technology to capture bright, HD footage of the nocturnal habits of animals around the globe. Six episodes stream today, to be followed by a second batch of six arriving sometime next year.\n\nEnding Disease Trailer Documentary ($) Virtual theaters\n\nElyse Drama ($) Rent/Buy\n\nIsla Fisher and Jillian Bell star in Disney's new holiday comedy about a fairy godmother trainee.\n\nThe Great British Baking Show: Holidays Trailer Reality competition\n\nThe Hardy Boys Trailer Drama\n\nRohan Campbell and Alexander Elliot star as the titular teen detectives in this 13-episode adaptation of the classic children's book series by the famously nonexistent Franklin W. Dixon. All episodes are available to stream today.\n\nThe Hollywood Christmas Parade Greatest Moments Special 8p\n\nI Hate New Year's Trailer Rom-com ($) Rent/Buy\n\nLeyla Everlasting Trailer Foreign/Comedy\n\n▣ Luxor Trailer Drama ($) Rent/Buy\n\nMacGyver Drama 8p\n\nMacho: The Hector Camacho Story Trailer Documentary/Sports 9p\n\nMagnum P.I. Drama 9p\n\n▣ Mank Trailer Drama\n\nDirector David Fincher's first feature since 2014's Gone Girl is a 1930s-set biopic centering on screenwriter Herman J. Mankiewicz as he attempts to complete what would become his most famous screenplay, Citizen Kane. The black-and-white film stars Gary Oldman as Mankiewicz and Tom Burke as Kane director Orson Welles, plus Amanda Seyfried, Charles Dance, and Lily Collins. The film will also receive some a limited theatrical release (mainly for awards-qualifying purposes) beginning November 13.\n\nMariah Carey’s Magical Christmas Special Variety Apple TV+\n\nMusic Got Me Here Trailer Documentary ($) Virtual theaters\n\nPokémon Journeys: The Series Animation/Family\n\nChristian Serratos (The Walking Dead) portrays the late Tejano pop star Selena Quintanilla in a two-part series dramatizing her life and career. The first part, spanning six episodes, streams today, with the remainder arriving at a later date.\n\nThe third film in Steve McQueen's Amazon anthology series is based on a true story of a young black man who switches career paths from science to policing after his father is assaulted by cops. John Boyega and Steve Toussaint head the cast.\n\nCritically acclaimed when it debuted at TIFF in the fall of 2019, where Amazon acquired the film, the narrative directorial debut for Darius Marder (co-writer of The Place Beyond the Pines) stars Riz Ahmed as the drummer of a noise metal band who is forced to reexamine his life when he loses his hearing. Ahmed was singled out by critics for delivering another stunning performance, which required him to learn both drumming and American Sign Language. For what it's worth, the film technically opens in theaters on November 20th.\n\nStillwater Trailer Animation/Family Apple TV+\n\nToo Close for Christmas Drama Lifetime, 8p\n\nSAT / December 5\n\nBaby Chimp Rescue Reality BBC America, 8p\n\nChristmas in Evergreen: Bells Are Ringing Drama Hallmark, 8p\n\nDetention Foreign/Drama\n\nKid of the Year Special 8p\n\nLet's Meet Again on Christmas Eve Drama Lifetime, 8p\n\nMighty Express: A Mighty Christmas Trailer Animation/Family\n\nMost Terrifying With Jason Hawes Reality Travel, 9p\n\nSecrets in the Snow Drama LMN, 8p\n\nTime for Us to Come Home for Christmas Drama HMM, 9p\n\nSUN / December 6\n\n90 Day Fiancé Reality TLC, 8p\n\nAmerican Monster Reality ID, 9p\n\nBlack Sabbath: Breaking the Band Documentary/Music Reelz, 8p ET\n\nThe Case Died With Her Reality Oxygen, 7p\n\nChallenge Accepted! Disney Channel's Epic Holiday Showdown Reality Disney, 7p\n\nChristmas Ever After Drama Lifetime, 8p\n\nChristmas on the Range Drama UP, 7p\n\nChristmas She Wrote Drama Hallmark, 8p\n\nEuphoria Drama 9p\n\nThe first of two special holiday episodes of the new-ish HBO drama series.\n\nA Holly Dolly Christmas Music 8:30p ET / 8p PT\n\nLazor Wulf Trailer Animation/Comedy Adult Swim, midnight\n\nA Little Christmas Charm Drama HMM, 10p\n\nMetallica: The Story of the Songs Documentary/Music Reelz, 9p ET\n\nMTV Movie & TV Awards: Greatest of All Time Special MTV, 8p\n\nPower Book II: Ghost Trailer Drama Starz, tbd\n\nThe Real Housewives of Atlanta Reality Bravo, 8p\n\nShameless Trailer Comedy 9p\n\n▣ Your Honor Trailer Drama 10p\n\nBryan Cranston heads the cast of a 10-episode legal thriller set in New Orleans that also stars Michael Stuhlbarg, Isiah Whitlock Jr., Carmen Ejogo, Hope Davis, Blair Underwood, Amy Landecker, and Sofia Black-D'Elia. Cranston plays a judge who is forced to turn to extreme measures to protect his son after the latter is involved in a hit-and-run accident. An adaptation of the Israeli show Kvodo, the miniseries comes from the Good Fight team of Robert and Michelle King, along with writer Peter Moffat (The Night Of), who serves as showrunner. Edward Berger (Patrick Melrose) directs multiple episodes.\n\nMON / December 7\n\nBizarre Foods: Delicious Destinations Reality Cooking, 10p\n\n▣ Nurses Drama 10p\n\nThe latest Canadian series picked up by NBC to fill covid-related holes in its schedule, medical drama Nurses offers a rare chance to see a series filmed in Toronto that is actually supposed to be set in Toronto. After next Monday's episode, the series will move to Tuesdays at 10p beginning 1/5.\n\nThe Santa Squad Drama Lifetime, 8p\n\n▣ A Suitable Boy Trailer Drama Acorn TV\n\nMaking its North American debut via Acorn TV (it's on Netflix in most of the world), this six-part BBC adaptation of Vikram Seth's 1993 coming-of-age novel follows a university student in 1950s India. Mira Nair (Monsoon Wedding) directs from a script by Andrew Davies (Bleak House, Les Misérables).\n\nTUE / December 8\n\n40 Years a Prisoner Trailer Documentary 9p\n\nBobbleheads: The Movie Trailer Animation/Family ($) Rent/Buy\n\nA Christmas for Mary Drama OWN, 9p\n\nDeep in Vogue Trailer Documentary ($) Rent/Buy\n\nEmicida: AmarElo: It's All for Yesterday (É Tudo Para Ontem) Foreign/Documentary\n\nThe Godfather Coda: The Death of Michael Corleone Trailer Drama ($) Rent/Buy\n\nFrancis Ford Coppola can't stop tinkering with his own films. This time, however, the result could be an improvement—perhaps. The director has taken his maligned 1990 sequel The Godfather: Part III and re-edited it, giving the film a new beginning and ending (and title) among other alterations.\n\nGuitar Man Trailer Documentary/Music ($) Rent/Buy\n\nLovestruck in the City Foreign/Comedy/Drama\n\nThe Planters Trailer Comedy ($) Rent/Buy\n\nSmiley Face Killers Trailer Thriller ($) Rent/Buy\n\nSpirit Riding Free: Ride Along Adventure Interactive/Animation/Family\n\nSuper Monsters: Santa's Super Monster Helpers Animation/Family\n\nWED / December 9\n\nAlabama Snake Trailer Documentary 9p\n\nAshley Garcia: Genius in Love Christmas Special Family/Comedy\n\nThe Big Show Show Christmas Special Family/Comedy\n\nThe Challenge: Double Agents Reality competition MTV, 8p\n\nDr. Seuss' The Grinch Musical! Musical 8p\n\nMatthew Morrison stars as the title character in NBC's latest musical production, which will be recorded in London (rather than performed live as they typically are).\n\nThe Great Christmas Light Fight Reality competition 8p\n\nGreatest Holiday Commercials Countdown 2020 Special 8p\n\nRose Island Trailer Foreign/Comedy\n\nThe Surgeon's Cut Trailer Reality\n\nTHU / December 10\n\nAlice in Borderland Trailer Foreign/Drama\n\nEsme & Roy Holiday Special Animation/Family HBO Max\n\nSet in Sri Lanka in the early 1980s, this coming-of-age drama from director Deepa Mehta (best known for her Fire/Earth/Water trilogy) is Canada's official Oscar entry this year. (It's based on a Canadian novel by Shyam Selvadurai.) It'll also screen in some theaters beginning today.\n\nHaute Dog Holiday Special Reality competition HBO Max\n\nHouse of Ho Reality HBO Max\n\nSteven Soderbergh's follow-up to The Laundromat reunites the director with star Meryl Streep. Here, she plays an author who reunites with old friends on a cruise, and she's joined by a cast that includes Candice Bergen, Dianne Wiest, Gemma Chan, and Lucas Hedges.\n\nMadagascar: A Little Wild Animation/Family Hulu/Peacock\n\nOne Night Only: The Best of Broadway Variety 8p\n\nSilent Night - A Song for the World Documentary/Music 8p\n\nSummer Camp Island Trailer Animation/Family HBO Max\n\nTime Person of the Year Special 10p\n\nFRI / December 11\n\n▣ Assassins Trailer Documentary ($) Virtual theaters\n\nThe latest doc from Ryan White (The Case Against 8) looks at the airport assassination of the half-brother of North Korean leader Kim Jong-un by two women who are now on death row despite insisting that they thought they were involved in a harmless prank and not a killing.\n\nCanvas Trailer Animation/Family/Drama\n\nThe Christmas Caroler Challenge Reality competition 8p\n\nClifford the Big Red Dog Animation/Family Prime Video\n\nCraft in America Reality 9p\n\nCurious George Animation/Family Peacock\n\nDisney Channel Holiday House Party Comedy Disney, 8p\n\nFinding Yingying Documentary ($) Virtual theaters\n\nGiving Voice Trailer Documentary\n\n▣ Gunda Trailer Documentary ($) Virtual theaters\n\nHigh School Musical: The Musical: The Holiday Special Trailer Music Disney+\n\nWith the next season of The Marvelous Mrs. Maisel delayed by covid, those in need of their yearly Rachel Brosnahan fix can get it with this thriller from writer-director Julia Hart (Fast Color) in which Brosnahan plays a woman on the run with her infant child after the disappearance of her criminal husband. The film will also get a limited theatrical release beginning on December 4.\n\nInn Love by Christmas Drama Lifetime, 8p\n\nMadagascar: A Little Wild Animation/Family Peacock\n\nThe Mess You Leave Behind Trailer Foreign/Drama\n\nMichael Kosta: Detroit. NY. LA. Trailer Comedy special 11p\n\nMy Lottery Dream Home: Holiday Extravaganza Reality HGTV, 8p\n\nNoise in the Middle Horror ($) Rent/Buy\n\nRyan Murphy directs an adaptation of the Broadway musical starring Meryl Streep, Nicole Kidman, James Corden, Andrew Rannells, Keegan-Michael Key, and Kerry Washington.\n\nReginald Hudlin directs this based-on-a-true-story drama about a Clemson football player (Jay Reeves) who raises his 11-year-old brother on campus.\n\n▣ Small Axe: Alex Wheatle Drama/Anthology Prime Video\n\nThe penultimate film in Steve McQueen's Amazon anthology examines the formative years of British novelist Alex Wheatle, including a stint in prison following 1981's Brixton Uprising.\n\n▣ Songbird Trailer Sci-fi/Thriller ($) Rent\n\nSkipping theaters and arriving today instead as a $20 digital rental, this Michael Bay-produced dystopian thriller was not only filmed during the pandemic, it's set during it, too (albeit three years in the future, when the still-ongoing disease has mutated into covid-23). KJ Apa, Sofia Carson, Craig Robinson, Bradley Whitford, and Demi Moore star.\n\nDrew Barrymore plays dual roles as an actress headed to rehab and her on-set stand-in—who winds up stealing her life— in a comedy directed by Jamie Babbit (But I'm a Cheerleader) and scripted by Sam Bain (Peep Show).\n\nA Trash Truck Christmas Animation/Family\n\nThe Very Excellent Mr. Dundee Trailer Comedy ($) Rent/Buy\n\nWondering what Crocodile Dundee's Paul Hogan was up to these days? No? Well, we'll tell you anyway: He's playing actor Paul Hogan in this new comedy that somehow also brings together Olivia Newton-John, John Cleese, Chevy Chase, and Reginald VelJohnson.\n\nThe Weasel's Tale Trailer Foreign/Comedy/Thriller ($) Virtual theaters\n\nWhere's Waldo? Animation/Family Peacock\n\nJamie Dornan, Emily Blunt, and Jon Hamm star in an Irish romance from writer-director John Patrick Shanley (Doubt), who adapts his own play.\n\nThe Wilds Trailer Drama Prime Video\n\n▣ Wolfwalkers Trailer Animation/Family Apple TV+\n\nFollowing Metacritic Must-Sees The Secret of Kells and Song of the Sea, this tale of a young apprentice hunter who befriends a girl raised by wolves completes director Tom Moore’s Irish folklore trilogy. It’s another critical hit for the animation studio Carton Saloon, thanks to terrific reviews out of its TIFF premiere this fall, and the film comes to Apple's streaming service today following an awards-qualifying theatrical run kicking off November 13.\n\nYalda, A Night for Forgiveness Trailer Foreign/Drama ($) Virtual theaters\n\nSAT / December 12\n\nFrank Marshall directs a look at the 1960s and '70s hitmakers.\n\nThe Christmas Setup Drama Lifetime, 8p\n\nCross Country Christmas Drama Hallmark, 8p\n\nA Glenbrooke Christmas Drama HMM, 9p\n\nPretty Little Dead Girl Drama LMN, 8p\n\nToys of Terror Horror Syfy, 10p\n\nSUN / December 13\n\nAutopsy: The Last Hours of Tom Petty Documentary/Music Reelz, 9p ET\n\nThe Bounce Trumpet Awards: Stand Up Special Bounce, 8p\n\nChristmas Comes Twice Drama Hallmark, 8p\n\nChristmas Homecoming Drama HMM, 9p\n\nA Christmas Princess Drama UP, 7p\n\nCouples Therapy: The COVID Special Trailer Reality 8p\n\nDashing in December Trailer Drama Paramount, 7p\n\nThe Jane Doe Murders Reality Oxygen, 7p\n\nLife, Death & Money Reality Reelz, 10p ET\n\n▣ Pennyworth Trailer Drama Epix, 9p\n\nFour episodes (including a double episode on 12/27) air over the coming weeks, but the remaining six episodes of season 2 won't arrive until later in 2021.\n\nA Sugar & Spice Holiday Drama Lifetime, 8p\n\nTom Petty: Won't Back Down Documentary/Music Reelz, 8p ET\n\nThe Walking Dead Holiday Special Talk AMC+\n\nMON / December 14\n\nA California Christmas Rom-com\n\nCelebrity IOU Reality HGTV, 9p\n\nChristmas With the Tabernacle Choir Music 9p\n\nDeliciousness Trailer Comedy/Reality MTV, 7p\n\nHaul This House Reality FYI, 8p\n\nHilda Animation/Family\n\niHeartRadio Jingle Ball Music 8p\n\nLonestar Christmas Drama Lifetime, 8p\n\nRéunions Foreign/Drama Acorn TV\n\nBilled as \"Black Swan meets Pretty Little Liars,\" this 10-episode adaptation of the book by Sona Charaipotra and Dhonielle Clayton follows the students of an elite ballet academy in Chicago.\n\nTUE / December 15\n\nCooking Up Christmas Drama OWN, 9p\n\nThe Last Blockbuster Trailer Documentary ($) Rent/Buy\n\nAdam Brody, Doub Benson, Kevin Smith, and Paul Scheer are among the talking heads in this Lauren Lapkus-narrated documentary about the history of Blockbuster Video and the chain's sole surviving outlet in Bend, Oregon.\n\nThe Last Sermon Trailer Documentary ($) Rent/Buy\n\n▣ Lupin III: The First Anime ($) Buy\n\nPlay On: Celebrating the Power of Music to Make Change Music 8p\n\nSong Exploder Music\n\nFour new episodes feature Nine Inch Nails, Dua Lipa, The Killers, and Natalia Lafourcade.\n\nSpeaking of \"the last blockbuster,\" what will likely be 2020's final tentpole film—Christopher Nolan's time-twisting thriller—heads to home video today (both at digital outlets and on disc), finally giving people in cities without open theaters a chance to see it.\n\nWalking With Elephants Trailer Documentary/Nature Animal Planet, 8p\n\nWED / December 16\n\nAnitta: Made In Honorio Reality/Music\n\nThe Art of Political Murder Trailer Documentary 9p\n\nBreak It All: The History of Rock in Latin America Documentary/Music\n\n▣ The Expanse Trailer Sci-fi/Drama Prime Video\n\nHow to Ruin Christmas: The Wedding Comedy/Drama\n\nThe Ripper Trailer Documentary\n\nRun On Foreign/Drama\n\nVir Das: Outside In - The Lockdown Special Comedy special\n\nTHU / December 17\n\nDogs of the Year Reality 8p\n\nHomeschool Musical Class of 2020 Music HBO Max\n\nSesame Street: Holiday at Hooper's Family HBO Max\n\n▣ The Stand Trailer Drama/Horror/Fantasy CBS All Access\n\nStreaming weekly, this nine-episode adaptation of Stephen King's epic apocalyptic novel about life in America after a devastating global pandemic (no relation) stars Alexander Skarsgård, Whoopi Goldberg, James Marsden, Amber Heard, Heather Graham, Greg Kinnear, Odessa Young, and Nat Wolff. The series, which wrapped up two years of production just before covid-19 hit, features an all-new ending written by King.\n\nFRI / December 18\n\nDirector Thomas Vinterberg rebounds from a pair of lackluster films by reuniting with Mads Mikkelsen (who starred in Vinterberg's acclaimed 2013 feature The Hunt) for this story of four high school teachers who conspire to drink throughout the day to maintain the theoretically ideal blood alcohol level of 0.05%. (We don't recommend trying that at home, but then again it is 2020.) The film is Denmark's official Oscar entry this year.\n\nChristmas on the Menu Drama Lifetime, 8p\n\nA Creepshow Holiday Special Horror Shudder\n\nAnna Camp and Adam Pally star in an hour-long holiday episode.\n\nEl Cid Trailer Foreign/Drama Prime Video\n\nThe Grand Tour Presents: A Massive Hunt Trailer Reality Prime Video\n\n▣ Greenland Trailer Thriller ($) Rent\n\nViola Davis (starring as real-life blues singer Ma Rainey) and the late Chadwick Boseman (in what will stand as his final film) head the cast for an adaptation of August Wilson's play set in 1927 Chicago from director George C. Wolfe.\n\nOn Pointe Trailer Reality Disney+\n\nSix-part series follows the young students (ages 8-18) at New York's School of American Ballet as they rehearse for a production of Balanchine's The Nutcracker.\n\n▣ Small Axe: Education Drama/Anthology Prime Video\n\nSteve McQueen's Amazon anthology series concludes with a coming-of-age story about a 12-year-old boy whose wrongful transfer to a \"special needs\" school tips parents off to systemic racial discrimination in their school system.\n\nSunken Roads: Three Generations After D-Day Trailer Documentary ($) Virtual theaters\n\nSweet Home Foreign/Drama\n\nYou'll Be Home for Christmas Reality HGTV, 10p\n\nSAT / December 19\n\nChristmas at Rosemont Drama UP, 7p\n\nChristmas Carousel Drama Hallmark, 8p\n\nA Christmas Exchange Drama Lifetime, 8p\n\nLetters to Satan Claus Horror Syfy, 8p\n\nStolen in Plain Sight Drama LMN, 8p\n\nSwept Up by Christmas Drama HMM, 9p\n\nSUN / December 20\n\n22nd Annual A Home for the Holidays Special 9:30p ET/9p PT\n\nA Christmas Break Drama Lifetime, 8p\n\nDiana Ross: Story of Her Songs Documentary/Music Reelz, 10p ET\n\nGarth & Trisha Live! Music 8:30p ET / 8p PT\n\nLove, Lights, Hanukkah! Drama Hallmark, 8p\n\nMarch of the Polar Bears Reality Nat Geo WILD, 8p\n\nProject Christmas Wish Drama HMM, 9p\n\nUnexpected Reality TLC, 10p\n\nWhitney Houston: Story of Her Songs Documentary/Music Reelz, 9p ET\n\nMON / December 21\n\nDr. Pimple Popper Reality TLC, 9p\n\nLet's Make a Deal Primetime Game show 8p\n\nSpotlight on Christmas Drama Lifetime, 8p\n\nTUE / December 22\n\nThe Christmas High Note Drama Lifetime, 8p\n\nFirst Christmas Drama OWN, 9p\n\nLondon Hughes: To Catch a D*ck Comedy special\n\nRhyme Time Town Singalongs Family\n\nShortcut Horror ($) Rent/Buy\n\nWED / December 23\n\ntbd Buddy Valastro special Reality Food, 9p\n\nChristmas at the Castle Drama Lifetime, 8p\n\nBilled as Gravity meets The Revenant (and even shares a screenwriter, Mark L. Smith, with the latter), this George Clooney-directed adaptation of the novel Good Morning, Midnight centers on a dying scientist (Clooney) who must find a way to send a message to the crew of a long-term space mission and warn them not to return to Earth, which is in the midst of a global catastrophe. To do so, he must trek across the Arctic, which has become toxic. Felicity Jones, David Oyelowo, Kyle Chandler, Demián Bichir, and Tiffany Boone also star.\n\nYour Name Engraved Herein Foreign/Drama\n\nTHU / December 24\n\nA Music Lover's Guide to Murdoch Mysteries Special Acorn TV\n\nFRI / December 25\n\n▣ Bridgerton Trailer Drama\n\nIs this the next Downton Abbey? Producer Shonda Rhimes' first Netflix series is created by Scandal's Chris Van Dusen, who adapts Julia Quinn's popular novel series. The costume drama is set in London in the 1810s, where it focuses on the large and powerful Bridgerton family and other members of the city's aristocracy. Julie Andrews, Polly Walker, Rege-Jean Page, Ruby Barker, Jonathan Bailey, Claudia Jessie, Ruth Gemmell, Luke Thompson, and Luke Newton are among the stars.\n\nCall the Midwife Holiday Special Drama 9p\n\nDisney Gallery: The Mandalorian Documentary Disney+\n\nMy Sweet Holiday Drama Lifetime, 8p\n\nOriginally slated to reach theaters in June (and then November), the newest Pixar original is now a Disney+ exclusive instead. The recipient of stellar reviews when it debuted at the London Film Festival in October, the latest from director Pete Docter (Inside Out, Up) is an ambitious, original story following a middle-school music teacher whose quest to perform at a top jazz club takes him on a journey through a fantastical land populated by unborn souls. Jamie Foxx leads a voice cast that also features Tina Fey and Angela Bassett, while music comes from Jon Batiste and the team of Trent Reznor and Atticus Ross. Burrow, the Pixar short that would have screened alongside Soul in theaters, is also available to stream today.\n\nSurprising Santa Claus Reality HGTV, 9p\n\nWe don't recommend doing this; he's old and overweight and probably has heart issues.\n\n▣ Sylvie's Love Trailer Drama Prime Video\n\nTessa Thompson stars as a woman seeking to become a TV producer in 1950s New York in this now-Amazon-exclusive drama that was previously headed to a theatrical release (and will likely still make a brief appearance in theaters to qualify for awards).\n\nSo much for those \"Only in Theaters\" posters. After seeing its release date pushed back three times during the pandemic, the sequel to the 2017 hit Wonder Woman will no longer rely on theaters in the United States (though it should still reach any that remain open). Instead, Warner Bros. will use its $200 million film as a tax write-off to juice subscriptions to its new-ish HBO Max streaming service. (Already a subscriber? Consider it a Christmas present.) Director Patty Jenkins and stars Gal Gadot and Chris Pine return from the previous film—easily the best entry in the DC Extended Universe—but action this time will be set many decades later in the heart of the Cold War. New stars include Kristen Wiig (as Dr. Minerva/Cheetah) and Pedro Pascal (as Maxwell Lord).\n\nSAT / December 26\n\nAsphalt Burning (aka Børning 3) Foreign/Action/Comedy\n\nDNA Foreign/Drama\n\nThe latest feature from actor/director Maïwenn (Polisse) was a Cannes selection this year (but, obviously, did not get a chance to actually screen there).\n\nFast & Furious Spy Racers Animation/Family\n\nGo! Go! Cory Carson Animation/Family\n\n▣ Letterkenny Trailer Comedy\n\nThe Magic School Bus Rides Again In the Zone Animation/Family\n\nSUN / December 27\n\n▣ The Masked Dancer Trailer Reality competition 8p\n\nThis Masked Singer sister show, in which elaborately costumed celebrities perform choreographed routines and audiences must determine their identities, actually has its origins in a segment on Ellen DeGeneres‘ daytime series. Craig Robinson hosts, while the judging panel includes Paula Abdul, Ashley Tisdale, Brian Austin Green, and the obligatory Ken Jeong. Note that the series will move to Wednesday nights at 8p starting 1/6.\n\nRestaurant Hustle 2020: All on the Line Documentary Food, 9p\n\nMON / December 28\n\nAtlanta Justice Reality ID, 9p\n\nCops and Robbers Animated short\n\nKids Baking Championship Reality competition Food, 9p\n\nTUE / December 29\n\n7 Little Johnstons Reality TLC, 8p\n\nPopstar's Best of 2020 Special 8p\n\nThis countdown of the greatest moments of 2020 could be the shortest program ever to air on The CW.\n\nStreets of Dreams with Marcus Lemonis Reality CNBC, 10p\n\nSupermarket Stakeout Reality competition Food, 10p\n\nWED / December 30\n\nBest Leftovers Ever! Reality competition\n\nEquinox Foreign/Drama\n\nHeroes on the Front Line Reality 8p\n\nTransformers: War for Cybertron - Earthrise Anime\n\nThe second installment in the animated trilogy follows Siege released earlier this year.\n\n▣ Yearly Departed Comedy Prime Video\n\nPhoebe Robinson, Rachel Brosnahan, Tiffany Haddish, Sarah Silverman, and Natasha Leggero are among the comedians and celebrities delivering \"eulogies\" for the year 2020, which could finally come to an end as soon as tomorrow.\n\nTHU / December 31\n\nBest of Stand-Up 2020 Comedy", "images": ["https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/disneyplus202012-50.jpg", "https://static.metacritic.com/images/features/main/hbo202012-50.jpg", "https://static.metacritic.com/images/features/main/tvpreview_2020_12soul-180.jpg", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/main/hulu202012-50.jpg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/products/movies/8/4cb9efc1b1892ea3aff943cee8f56b70-98.jpg", "https://static.metacritic.com/images/products/tv/1/8234d7bf89ea3e2d94776781e9a94141-98.jpg", "https://static.metacritic.com/images/features/main/netflix202012-50.jpg", "https://static.metacritic.com/images/features/main/tvpreview_2020_12soul-50.jpg", "https://static.metacritic.com/images/products/movies/6/42028880c5909d557d6cbc693b522e33-98.jpg", "https://static.metacritic.com/images/products/music/7/3b4403a3d350497c20cec6fc983ab007-98.jpg", "https://static.metacritic.com/images/products/music/6/a438c2975d6ff04a18303521ed16ac48-98.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/main/amazon202012-50.jpg", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/products/music/9/d70e6bde46ec7980f20dd17d4b05a8ba-98.jpg", "https://static.metacritic.com/images/features/main/freegamesNEW2020-180.jpg", "https://static.metacritic.com/images/products/movies/0/182a07cca34c606b440cc333edb9e974-98.jpg", "https://static.metacritic.com/images/features/main/playstation5-28.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/games/9/b98a1d69c467b0ad796ded383599eb72-98.jpg", "https://static.metacritic.com/images/products/tv/1/52487b72befe47ce45bfa640ce2a6a13-98.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/products/games/4/f7f4eaa2b20b40171c034f1e4be1d22b-98.jpg", "https://static.metacritic.com/images/features/main/hbo202012-180.jpg", "https://static.metacritic.com/images/features/main/midyear_2020_music-180.jpg", "https://static.metacritic.com/images/products/games/5/428228b425381aeab1e47899622d42ec-98.jpg", "https://static.metacritic.com/images/features/main/coronavirusdelays-28.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/products/tv/0/02ae372a970b3c7de95aa07725117628-98.jpg", "https://static.metacritic.com/images/products/tv/2/42525a4997824c99138152d8b9fd09b1-98.jpg", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/starz202010-50.jpg", "https://static.metacritic.com/images/products/tv/7/3d2c0f1e19f99e8d3e8cfc35912b0048-98.jpg", "https://static.metacritic.com/images/products/music/5/2b2e2a640a978622cbfd1f837905a5ab-98.jpg", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/main/xboxseriesx-28.jpg", "https://static.metacritic.com/images/products/movies/3/62cf544058e622ab0c3eb4056cadf454-98.jpg", "https://static.metacritic.com/images/products/music/4/e108f7dc48bff0f6b758abc7f298dfe4-98.jpg", "https://static.metacritic.com/images/products/games/7/1aa54a2d35e13b422ee8fcc40c1126fd-98.jpg", "https://www.metacritic.com/images/icons/mc-mustplay-sm.svg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/features/main/appletvplus202012-50.jpg", "https://static.metacritic.com/images/products/movies/3/958abfd496ce8e90662aec0e11b08bc6-98.jpg", "https://www.metacritic.com/images/icons/mc-mustsee-sm.svg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/products/games/2/75b011355cdf934ac205305bbeb8b5ac-98.jpg"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "2020-21 Fall/Winter TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "og": {"title": "2020-21 Fall/Winter TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}