{"url": "http://www.newslocker.com/en-us/news/celebrity/5-badass-moments-from-the-kingsman-the-golden-circle-trailer-in-gifs/", "text": "'The Mandalorian' Cast WWE Star Sasha Banks After Sending Her An Instagram Message Mercedes Varnado might be checking her Instagram messages a little more from now on.\n\nIn a brand new interview with The Hollywood Reporter, the 28-year-old actress, who you might recognize as WWE’s Sasha Banks, revealed that the Disney+ show reached out to her for a role on The Mandalorian through social media.\n\n“One day, for some reason, I was going through my Instagram DMs, which I normally don’t go through, and a casting director messaged me and said, ‘Jon Favreau reall Read more\n\nEmilia Clarke Came Up With a 'Game of Thrones' Speech In Valyrian In Just 10 Minutes Despite Game of Thrones having been over for a year, there are still factoids coming out about the stars of the show.\n\nIn a new interview, director Jeremy Podeswa opened up about the time that Emilia Clarke seriously impressed him by coming up with a full speech in Valyrian in just ten minutes.\n\nThe scene in question was the one where Daenerys ordered the execution of one of three Meereenese noblemen who had been thought to have conspired against her. In the original script, Daenerys delivers a s Read more\n\nArmie Hammer Won't Be Spending Thanksgiving With His Kids For This Reason It doesn’t look like Armie Hammer will be spending the Thanksgiving holiday with his children this year.\n\nAccording to a report from People, the 34-year-old actor has had some trouble getting back down to the Cayman Islands to spend the holiday with his children, Harper, 5, and Ford, 3.\n\nA source revealed that Armie “was supposed to fly to the Cayman Islands, quarantine and then spend Thanksgiving with the kids and his family, flying back to L.A. all together in mid December.”Bu Read more\n\nJessica Alba Masks Up While Out Picking Up Lunch to Go Jessica Alba is staying safe while out picking up lunch!\n\nThe 39-year-old Good Luck Chuck actress and Honest Beauty founder stopped by Kreation shop to grab lunch and a juice to go on Sunday afternoon (November 22) in Los Angeles.\n\nPHOTOS: Check out the latest pics of Jessica Alba\n\nJessica stayed safe tie-dyed face mask with a coordinating pink tie-dyed hoodie and sweatpants set for her quick afternoon outing.\n\nLast month, it was announced that Jessica‘s show L.A.’s Finest had been canc Read more\n\nZendaya Teases Upcoming Euphoria Episode, Confirms It's Not Part of Season 2 Zendaya has just shared a first look at the upcoming bonus episodes for Euphoria‘s first season.\n\nThe 24-year-old actress, who recently picked up an Emmy for her role as Rue, shared the first poster for the new episodes that will start airing on December 6 on HBO.\n\nThe slightly out of focus image is of Rue and the tagline reads “This Is Not Season 2”, just to remind fans about where the episode lies in the Euphoria universe.\n\nHere’s the official summary for the bonus episod Read more\n\nHugh Jackman & Wife Deborra-Lee Furness Bundle Up for Morning Dog Walk Hugh Jackman and wife Deborra-Lee Furness are stay warm on their morning walk!\n\nThe 52-year-old The Greatest Showman actor and the 64-year-old Australian producer went for a morning walk around their neighborhood with their dogs Dali and Allegra on Wednesday (November 25) in New York City.\n\nPHOTOS: Check out the latest pics of Hugh Jackman\n\nThe longtime couple bundled up in matching black, puffer jackets and stayed safe in face masks for their outing.\n\nJust last week, Hugh teased a new project that Read more\n\nIsabella Gomez to Star in 'Head of The Class' Reboot Pilot for HBO Max Isabella Gomez has a new show in the works!\n\nThe 22-year-old One Day at a Time actress has signed on to lead the pilot for the Head of The Class reboot for HBO Max, Deadline reports.\n\nIsabella‘s casting reveals a gender-swap for the original comedy series that aired on ABC in the 1980s with the lead being played by Howard Hesseman.\n\nWritten by Amy Pocha and Seth Cohen, “the re-imagined Head of The Class revolves around a group of overachieving high school students who meet their greate Read more\n\nJesse Tyler Ferguson & Husband Justin Mikita Deliver Meals Ahead of Thanksgiving Jesse Tyler Ferguson and Justin Mikita are giving back this Thanksgiving.\n\nThe 45-year-old former Modern Family actor and the 35-year-old producer helped deliver meals as part of the Project Angel Food program on Wednesday afternoon (November 25) in Los Angeles.\n\nPHOTOS: Check out the latest pics of Jesse Tyler Ferguson\n\nJesse and Justin stayed safe in face masks and gloves while they gave out meals to members of Project Angel Food, which helps people who are battling life-threatening illnesses.\n\nT Read more\n\nThomas Doherty Rocks Letterman Jacket On 'Gossip Girl' Set Before Thanksgiving Break Thomas Doherty shows off his handsome good looks while on the set of Gossip Girl in New York City on Wednesday afternoon (November 25).\n\nThe 25-year-old Scottish actor was spotted wearing a letterman jacket with his school uniform tie undone around his neck.\n\nThomas was joined on set by Evan Mock, Jordan Alexander and Emily Alyn Lind as they filmed a few additional scenes for the upcoming revival series ahead of the Thanksgiving holiday.\n\nEli Brown, Savannah Smith, Tavi Gevinson, Whitney Peak, and Read more\n\nMichael B. Jordan & Lori Harvey Spark Romance Rumors with Pre-Thanksgiving Trip! It looks like the Sexiest Man Alive might have a new leading lady in his life!\n\nRumors have been swirling that Michael B. Jordan and Lori Harvey might be dating after they spotted arriving in Atlanta together.\n\nIn the photos obtained by TMZ, the 33-year-old Black Panther actor and the 23-year-old daughter of Steve Harvey were seen making their way out of a plane together on Thanksgiving Eve, Wednesday (November 25) in her hometown of Atlanta, Georgia.\n\nThe two both stayed safe in face masks while Read more\n\nKatie Holmes & Boyfriend Emilio Vitolo Pick Up Some Flowers For A Perfect Thanksgiving Tablescape Katie Holmes keeps a low profile with her face mask and newsboy cap while out in New York City on Wednesday night (November 25).\n\nThe 41-year-old actress kept warm in a cute pea coat as she linked arms with boyfriend chef Emilio Vitolo, Jr.\n\nThe two took a little stroll in the Big Apple and picked up a large bouquet of flowers from a local shop, just a day ahead of the Thanksgiving holiday.\n\nPHOTOS: Check out the latest pics of Katie Holmes\n\nJust last week, Katie and Emilio were spotted picking up Read more\n\nHere's What Is Different About the 2020 Macy's Parade Due to the Pandemic The Macy’s Thanksgiving Day Parade is still happening this year amid the pandemic, but things will be different because of what’s happening in the world.\n\nIn normal years, it’s estimated that 3 million people line the streets of New York City on Thanksgiving morning to watch the balloons and floats march down Broadway en route to Herald Square.\n\nFor 2020, the parade route is being shortened significantly and will only take place along 34th street near the flagship Macy’s s Read more\n\nBen Affleck Stops By A Jewelry Store With Ana de Armas Ahead of Thanksgiving Ben Affleck wears a camouflage face mask and puffer coat as he runs a few errands around town in Los Angeles on Wednesday afternoon (November 25).\n\nThe 48-year-old actor was seen out with girlfriend and Knives Out star, Ana de Armas, who wore a long flowy skirt for their outing, which is just a day ahead of the Thanksgiving holiday.\n\nTogether, Ben and Ana were seen leaving the XIV Carats jewelry store along with a good friend of theirs. However, it didn’t look like they picked up anything a Read more\n\nHulk Hogan Reacts to Chris Hemsworth Playing Him in Upcoming Biopic! Hulk Hogan is ready to see Chris Hemsworth play him in a new movie!\n\nThe 67-year-old former pro wrestler took to his Twitter on Monday to share his thoughts on the 37-year-old actor bulking up to play him in a new biopic.\n\n“He’s already there! He’s ready BROTHER!!! But is he good looking enough to play me lol,lol,lol. HH,” Hulk tweeted along with a few throwback photos of himself showing off his muscles, while also re-posting a recent pics Chris posted on Instagram while w Read more\n\nNikki & Brie Bella Are Serious About Their Return To The WWE Nikki and Brie Bella bid goodbye to the WWE just a few years ago, however, it looks like the twin sisters could return to the ring once again.\n\nDuring an appearance on The Tamron Hall Show, the 37-year-old pro wrestlers, and new moms, revealed that they have a bucket list item of getting back in the ring.\n\n“When Nikki and I left, the Tag Team titles came and we were like, wait a second, those titles are for the Bella twins, how’d they come after us?” Brie shared, and added that Read more\n\nWarner Bros. Officially Confirms Mads Mikkelsen as Johnny Depp's Replacement in 'Fantastic Beasts 3' It’s official – Mads Mikkelsen has joined the Harry Potter franchise!\n\nThe 55-year-old actor will be replacing Johnny Depp as Gellert Grindelwald in the upcoming Fantastic Beasts 3, Warner Bros. announced via IndieWire.\n\nJohnny departed the film franchise after losing his libel case against The Sun earlier this month.\n\nMads is best known for his roles in the TV show Hannibal and movies Casino Royal and Rogue One: A Star Wars Story. He also recently wrapped filming on Chaos Walking oppo Read more\n\nBlake Lively & Ryan Reynolds Donate $500K To Support Homeless & Trafficked Youth Across Canada Ryan Reynolds and Blake Lively are in the giving mood this holiday season and giving back to a cause close to their hearts.\n\nIt was just revealed that the celeb couple have donated $500,000 to Covenant House in Vancouver, and their branch in Toronto.\n\n“In an incredible act of kindness and philanthropy, Ryan Reynolds and Blake Lively are donating $250,000 to Covenant House Vancouver and $250,000 to Covenant House Toronto to support homeless, at-risk, and trafficked youth across the nation,&r Read more\n\n'American Idol's Fantastia Barrino & Husband Kendall Taylor Expecting First Child Together! Fantasia Barrino is having another baby!\n\nThe 36-year-old American Idol winner announced on Tuesday (November 24) on her Instagram Live that she and husband Kendall Taylor are expecting their first child together.\n\nFantasia broke the news by first opening up about her fertility struggles, revealing that she turned to prayer to help conceive.\n\n“Keep trying and you will conceive,” Fantasia said, before standing up to reveal her baby bump.\n\nKendall then gave his wife a kiss on her belly, s Read more\n\nMegan Fox Officially Files For Divorce From Brian Austin Green It’s really over between Megan Fox and Brian Austin Green.\n\nAccording to The Blast, the 34-year-old actress filed for divorce from the 90210 alum today, November 25.\n\nMegan and Brian split earlier this year after she was linked to her Midnight in the Switchgrass co-star Machine Gun Kelly. She then went on to star in a music video of his.\n\nThere was a question of cheating as one of the reasons the couple broke up, however, Brian nixed that theory.\n\nBrian also opened up about how he found out a Read more\n\nChrissy Teigen Supports & Defends Meghan Markle Against Internet Troll After Duchess' Miscarriage Reveal Chrissy Teigen is showing her support for Meghan Markle, after the Duchess of Sussex revealed she had suffered a miscarriage earlier this summer.\n\nIn her essay for the New York Times, Meghan revealed how she knew she was losing her second child after experiencing a sharp pain.“I dropped to the floor with him [son Archie] in my arms, humming a lullaby to keep us both calm, the cheerful tune a stark contrast to my sense that something was not right,” Meghan wrote. “I knew, as I c Read more\n\nKate Hudson Joins Octavia Spencer on 'Truth Be Told' Set for Season Two! Kate Hudson is spending a late night on set of Truth Be Told!\n\nThe 41-year-old actress filmed some night scenes for the upcoming second season of the Apple TV+ show on Tuesday (November 24) in Los Angeles.\n\nPHOTOS: Check out the latest pics of Kate HudsonKate was spotted wearing a black cardigan over a gray shirt paired with black pants, heels, and sunglasses while she filmed in front of what appeared to be a church.\n\nEarlier in the day, Kate‘s co-star Octavia Spencer was seen wearing a face Read more", "images": ["https://img.newslocker.com/2020/11/26/222971461_725.jpg", "https://img.newslocker.com/2020/11/26/222971480_725.jpg", "https://img.newslocker.com/2020/11/26/222971463_725.jpg", "https://img.newslocker.com/2020/11/26/222971482_725.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://img.newslocker.com/2020/11/26/222971475_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017325/rs_600x600-170425050028-600.kingsman-thumb.gif?downsize=450:*&crop=450:350;left,top", "https://img.newslocker.com/2020/11/26/222971465_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img.newslocker.com/2020/11/26/222971466_725.jpg", "https://img.newslocker.com/2020/11/26/222971468_725.jpg", "https://img.newslocker.com/2020/11/26/222971481_725.jpg", "https://img.newslocker.com/2020/11/26/222976128_350.jpg", "https://img.newslocker.com/2020/11/26/222971471_725.jpg", "https://img.newslocker.com/2020/11/26/222971484_725.jpg", "https://img.newslocker.com/2020/11/26/222971462_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/share-linkedin.png", "https://img.newslocker.com/2020/11/26/222971477_725.jpg", "https://img.newslocker.com/2020/11/26/222976127_350.jpg", "https://img.newslocker.com/2020/11/26/222971483_725.jpg", "https://img.newslocker.com/2020/11/26/222971479_725.jpg", "https://img.newslocker.com/2020/11/26/222971460_725.jpg", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/share-twitter.png", "https://img.newslocker.com/2020/11/26/222971469_725.jpg", "https://img.newslocker.com/2020/11/26/222976129_350.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img.newslocker.com/2020/11/26/222971467_725.jpg", "https://img.newslocker.com/2020/11/26/222971474_725.jpg", "https://img.newslocker.com/2020/11/26/222971473_725.jpg", "https://img.newslocker.com/2020/11/26/222971478_725.jpg", "https://img.newslocker.com/2020/11/26/222971464_725.jpg", "https://img.newslocker.com/2020/11/26/222971472_725.jpg", "https://img.newslocker.com/2020/11/26/222976130_350.jpg", "https://img.newslocker.com/2020/11/26/222971470_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017325/rs_600x600-170425050028-600.kingsman-thumb.gif?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/5-badass-moments-from-the-kingsman-the-golden-circle-trailer-in-gifs/", "title": "5 Badass Moments From the Kingsman: The Golden Circle Trailer (in GIFs)", "meta_data": {"description": "Kingsman: The Golden Circle isn't your ordinary spy movie.The first trailer for Matthew Vaughn's highly anticipated sequel premiered on CBS' The Late Late Show Monday....", "og": {"title": "5 Badass Moments From the Kingsman: The Golden Circle Trailer (in GIFs) - Celebrity news - NewsLocker", "description": "Kingsman: The Golden Circle isn't your ordinary spy movie.The first trailer for Matthew Vaughn's highly anticipated sequel premiered on CBS' The Late Late Show Monday....", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/5-badass-moments-from-the-kingsman-the-golden-circle-trailer-in-gifs/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017325/rs_600x600-170425050028-600.kingsman-thumb.gif?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1493123400.0, "source": "http://www.newslocker.com", "summary": ""}